stress_dict = {
    'аселенА': ['асЕлена'],
    'аэропОрты': ['аэропортЫ'],
    'бАнты': ['бантЫ'],
    'бОроду': ['бородУ'],
    'бралА': ['брАла'],
    'бралАсь': ['брАлась'],
    'бухгАлтеров': ['бухгалтерОв'],
    'вернА': ['вЕрна'],
    'вероисповЕдание': ['вероисповедАние'],
    'взялА': ['взЯла'],
    'взялАсь': ['взЯлась'],
    'влилАсь': ['влИлась'],
    'водопровОд': ['водопрОвод'],
    'ворвалАсь': ['ворвАлась'],
    'воспринЯть': ['воспрИнять'],
    'воссоздалА': ['воссОздала'],
    'вручИм': ['врУчим'],
    'вручИт': ['врУчит'],
    'вручИшь': ['врУчишь'],
    'газопровОд': ['газопрОвод'],
    'гналА': ['гнАла'],
    'гналАсь': ['гнАлась'],
    'граждАнство': ['грАжданство'],
    'дешевИзна': ['дешевизнА'],
    'диспансЕр': ['диспАнсер'],
    'добралА': ['добрАла'],
    'добралАсь': ['добрАлась'],
    'дождалАсь': ['дождАлась'],
    'дозвонИтся': ['дозвОнится'],
    'дозИровать': ['дозировАть'],
    'донЕльзя': ['дОнельзя'],
    'еретИк': ['ерЕтик'],
    'жалюзИ': ['жАлюзи'],
    'ждалА': ['ждАла'],
    'жилОсь': ['жИлось'],
    'зАгнутый': ['загнУтый'],
    'закУпорив': ['закупОрив'],
    'закУпорил': ['закупОрил'],
    'закУпорить': ['закупОрить'],
    'зАнял': ['занЯл'],
    'занялА': ['зАняла'],
    'зАняли': ['занЯли'],
    'занятА': ['зАнята'],
    'заперлА': ['зАперла'],
    'запломбировАть': ['запломбИровать'],
    'защемИт': ['защЕмит'],
    'защемИшь': ['защЕмишь'],
    'звонИм': ['звОним'],
    'Иксы': ['иксЫ'],
    'каталОг': ['катАлог'],
    'квартАл': ['квАртал'],
    'киломЕтр': ['килОметр'],
    'клАла': ['клалА'],
    'клЕить': ['клеИть'],
    'кормЯщий': ['кОрмящий'],
    'корЫсть': ['кОрысть'],
    'крАлась': ['кралАсь'],
    'красИвее': ['красивеЕ'],
    'красИвейший': ['красивейшИй'],
    'кремЕнь': ['крЕмень'],
    'кремнЯ': ['крЕмня'],
    'кровоточАщий': ['кровотОчащий'],
    'кровоточИть': ['кровотОчить'],
    'кУхонный': ['кухОнный'],
    'лгалА': ['лгАла'],
    'лилА': ['лИла'],
    'лилАсь': ['лИлась'],
    'навралА': ['наврАла'],
    'локтЕй': ['лОктей'],
    'лОктя': ['локтЯ'],
    'мЕстностей': ['местностЕй'],
    'наделИм': ['надЕлим'],
    'надОлго': ['нАдолго'],
    'надорвалАсь': ['надорвАлась'],
    'нажИвший': ['нАживший'],
    'назвалАсь': ['назвАлась'],
    'накренИтся': ['накрЕнится'],
    'налИвший': ['нАливший'],
    'налилА': ['налИла'],
    'нанЯвшийся': ['нАнявшийся'],
    'нарвалА': ['нарвАла'],
    'начАвший': ['нАчавший'],
    'начАвшись': ['нАчавшись'],
    'нАчал': ['начАл'],
    'началА': ['нАчала'],
    'нАчали': ['начАли'],
    'нЕдруг': ['недрУг'],
    'некролОг': ['некрОлог'],
    'нефтепровОд': ['нефтепрОвод'],
    'новостЕй': ['нОвостей'],
    'нОгтя': ['ногтЯ'],
    'облегчИть': ['облЕгчить'],
    'облегчИт': ['облЕгчит'],
    'облилАсь': ['облИлась'],
    'обнялАсь': ['обнЯлась'],
    'обогналА': ['обогнАла'],
    'ободралА': ['ободрАла'],
    'ободрИться': ['обОдриться'],
    'ободрИшь': ['обОдришь'],
    'одолжИшь': ['одОлжишь'],
    'озлОбил': ['озлобИл'],
    'озлОбить': ['озлобИть'],
    'окружИм': ['окрУжим'],
    'опОшлит': ['опошлИт']
}

comma_list = ['Мало-помалу он перешел к убеждению, что если бы распространить Летний сад на все Марсово поле и даже '
              'соединить с дворцовым Михайловским садом, то была бы прекрасная и полезнейшая для города вещь.',
              'А то, что если вы еще раз осмелитесь упомянуть хоть одно слово о моей матери, то я вас с лестницы '
              'кувырком спущу!',
              'Имею честь при сем заранее предуведомить, что если встречу Родиона Романовича,'
              ' то принужден буду немедленно удалиться, и тогда пеняйте уже на себя.',
              'Отсюда прямо, что если общество устроить нормально, то разом и все преступления исчезнут,'
              ' так как не для чего будет протестовать, и все в один миг станут праведными.',
              'Поймите, что если вы не помиритесь, то я должна же выбирать между вами: или вы, или он.',
              'Что, если бы на моем месте случился Наполеон и не было бы у него, чтобы карьеру начать, ни Тулона, ни'
              ' Египта, ни перехода через Монблан, а была бы вместо всех этих красивых и монументальных вещей'
              ' просто-запросто одна какая-нибудь смешная старушонка, которую еще вдобавок надо убить, чтоб из сундука'
              ' у ней деньги стащить.',
              'Видишь, я тогда все себя спрашивал: зачем я так глуп, что если другие глупы и коли я знаю уж наверно,'
              ' что они глупы,то сам не хочу быть умнее?',
              'Потом я узнал, что если ждать, пока все станут умными, то слишком уж долго будет…',
              'Я сама на себе чувствую, что если б у меня было такое великое горе, то я бы тоже ушла от всех.',
              'И поверенный тетушек бойко провернул мировую сделку с ним, потому что, если бы дело дошло до суда,'
              ' Краевский и Киреев были бы вынуждены заплатить очень большую сумму.',
              'У меня сложилось впечатление, что если не пробовать экстремальный высший пилотаж, то летать и среднему'
              ' человеку вполне комфортно.',
              'Так что если услышите эти звуки в квартире холодной зимней ночью, не пугайтесь, потому что это дрожат'
              ' в шкафах замёрзшие моли.',
              'Ледяная вьюга легко уносит тепло с тела одинокого пингвина, но что, если несколько сотен птиц собьются'
              ' в кучу?',
              'Так что если молодые специалисты хотят поучаствовать в становлении отечественной дальней космонавтики,'
              ' это отличная возможность.',
              'Я решил, что если заниматься космосом, то не на словах, а на деле.',
              'С тех пор была надежда, что если сейчас Марс и непригоден для жизни, то эта возможность была в'
              ' геологическом прошлом.',
              'Сказали, что, если мы не выучим, как вязать узлы и как правильно называются все эти веревки, не выйдем в'
              ' порт.',
              'Еще Максим Горький предупреждал, что если считать всех людей плохими, то только плохие к тебе и придут.',
              'Однажды некий ученый открыл, что если освещать вращающееся колесо мгновенными вспышками света, то оно'
              ' кажется застывшим.',
              'До этого экономисты в своих прогнозах полагали, что если большинство людей в тех или иных случаях'
              ' принимало такие-то решения, то в дальнейшем они будут делать нечто подобное.',
              'Задача была столь сложна, что, если бы ее стали решать последовательно, на это ушли бы многие годы.',
              'Так что если вам дали задание создать прибор, который при понижении влажности подавал бы звуковые'
              ' сигналы, в данном случае входным воздействием следует считать параметр «влажность», а выходным'
              ' ― звуковые колебания.',
              'Поздравлять людей с праздниками очень важно, так что, если забудешь когда-нибудь кого-нибудь вовремя'
              ' поздравить, скажи, что была больна.',
              'Теперь по справедливости надо было бы признаться в том,  что если я стал доктором филологических наук и'
              ' профессором МГУ,  то  только потому,  что посещал в те годы этот замечательный семинар.',
              'С этим связано то, что если в первом случае длина фразы в значительной мере задает ее конструкцию, то во'
              ' втором ― текст имеет открытый характер.',
              'Отметим, что если анафорическая симметрия первых двух стихов лермонтовского текста подсказывает мысль об'
              ' их параллелизме, то их явная ритмическая неэквивалентность и эквивалентность первого и второго стихов'
              ' становится признаком противопоставления.',
              'Однако не следует думать, что если текст выдержан в одной семантической системе, то он не может создать'
              ' той сложной игры структурных элементов, которая и обеспечивает ему семантическую емкость, что связана с'
              ' искусством.',
              'Папа сказал мне, что когда он зашёл на кухню, воздухоочиститель ещё горел красным'
              ' пламенем и что, если бы он опоздал ещё хоть на чуть-чуть, то огонь перекинулся бы на кухонный гарнитур'
              ' и потом сгорел весь дом.',
              'Когда стали на места, Печорин сказал Грушницкому, что если он промахнется, то не должен надеяться'
              ' промаха с его стороны.',
              'Слава тебе господи, кончились ее истязания, но расскажу тебе все по порядку, чтобы ты узнал, как все'
              ' было и что мы от тебя до сих пор скрывали.',
              'Но господин Лебезятников, который следит за новыми мыслями, объяснял намедни, что сострадание в наше'
              ' время даже наукой воспрещено и что так уже делается в Англии, где политическая экономия.',
              'Кирсанов очень хорошо знает, что мы с тобой не Крезы и что у тебя не дворец',
              'Все знают, что Ольгин отец был всем обязан твоему и что дружба их была столь же священна, как самое'
              ' близкое родство',
              'Когда бранили его за то, что он пренебрегал французским или немецким языком, то он отвечал, что он'
              ' русский и что довольно для него, если он будет понимать слегка иностранные языки.',
              'Он отвечал, что земля теперь его и что прежде принадлежала она Дубровскому.'
]
